Autodesk.Revit.DB.LabelType
The label type in dimension equality formats.
Since:
2017 Subscription Update
Since:
2017 Subscription Update

Autodesk.Revit.DB.LabelType.TotalLength
The total length of the dimension.

Autodesk.Revit.DB.LabelType.LengthOfSegment
The length of segments of the dimension.

Autodesk.Revit.DB.LabelType.NumberOfSegments
The number of segments of the dimension.

Autodesk.Revit.DB.LabelType.NumberOfWitnessLines
The number of witness lines of the dimension.